; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p14---int100n150-m25---int100c110---s445---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level7 level7)
(sum level0 level13 level13)
(sum level0 level15 level15)
(sum level0 level20 level20)
(sum level0 level24 level24)
(sum level1 level4 level5)
(sum level1 level7 level8)
(sum level1 level13 level14)
(sum level1 level15 level16)
(sum level1 level20 level21)
(sum level1 level24 level25)
(sum level2 level4 level6)
(sum level2 level7 level9)
(sum level2 level13 level15)
(sum level2 level15 level17)
(sum level2 level20 level22)
(sum level2 level24 level26)
(sum level3 level4 level7)
(sum level3 level7 level10)
(sum level3 level13 level16)
(sum level3 level15 level18)
(sum level3 level20 level23)
(sum level3 level24 level27)
(sum level4 level4 level8)
(sum level4 level7 level11)
(sum level4 level13 level17)
(sum level4 level15 level19)
(sum level4 level20 level24)
(sum level4 level24 level28)
(sum level5 level4 level9)
(sum level5 level7 level12)
(sum level5 level13 level18)
(sum level5 level15 level20)
(sum level5 level20 level25)
(sum level5 level24 level29)
(sum level6 level4 level10)
(sum level6 level7 level13)
(sum level6 level13 level19)
(sum level6 level15 level21)
(sum level6 level20 level26)
(sum level6 level24 level30)
(sum level7 level4 level11)
(sum level7 level7 level14)
(sum level7 level13 level20)
(sum level7 level15 level22)
(sum level7 level20 level27)
(sum level7 level24 level31)
(sum level8 level4 level12)
(sum level8 level7 level15)
(sum level8 level13 level21)
(sum level8 level15 level23)
(sum level8 level20 level28)
(sum level8 level24 level32)
(sum level9 level4 level13)
(sum level9 level7 level16)
(sum level9 level13 level22)
(sum level9 level15 level24)
(sum level9 level20 level29)
(sum level9 level24 level33)
(sum level10 level4 level14)
(sum level10 level7 level17)
(sum level10 level13 level23)
(sum level10 level15 level25)
(sum level10 level20 level30)
(sum level10 level24 level34)
(sum level11 level4 level15)
(sum level11 level7 level18)
(sum level11 level13 level24)
(sum level11 level15 level26)
(sum level11 level20 level31)
(sum level11 level24 level35)
(sum level12 level4 level16)
(sum level12 level7 level19)
(sum level12 level13 level25)
(sum level12 level15 level27)
(sum level12 level20 level32)
(sum level12 level24 level36)
(sum level13 level4 level17)
(sum level13 level7 level20)
(sum level13 level13 level26)
(sum level13 level15 level28)
(sum level13 level20 level33)
(sum level13 level24 level37)
(sum level14 level4 level18)
(sum level14 level7 level21)
(sum level14 level13 level27)
(sum level14 level15 level29)
(sum level14 level20 level34)
(sum level14 level24 level38)
(sum level15 level4 level19)
(sum level15 level7 level22)
(sum level15 level13 level28)
(sum level15 level15 level30)
(sum level15 level20 level35)
(sum level15 level24 level39)
(sum level16 level4 level20)
(sum level16 level7 level23)
(sum level16 level13 level29)
(sum level16 level15 level31)
(sum level16 level20 level36)
(sum level16 level24 level40)
(sum level17 level4 level21)
(sum level17 level7 level24)
(sum level17 level13 level30)
(sum level17 level15 level32)
(sum level17 level20 level37)
(sum level17 level24 level41)
(sum level18 level4 level22)
(sum level18 level7 level25)
(sum level18 level13 level31)
(sum level18 level15 level33)
(sum level18 level20 level38)
(sum level18 level24 level42)
(sum level19 level4 level23)
(sum level19 level7 level26)
(sum level19 level13 level32)
(sum level19 level15 level34)
(sum level19 level20 level39)
(sum level19 level24 level43)
(sum level20 level4 level24)
(sum level20 level7 level27)
(sum level20 level13 level33)
(sum level20 level15 level35)
(sum level20 level20 level40)
(sum level20 level24 level44)
(sum level21 level4 level25)
(sum level21 level7 level28)
(sum level21 level13 level34)
(sum level21 level15 level36)
(sum level21 level20 level41)
(sum level21 level24 level45)
(sum level22 level4 level26)
(sum level22 level7 level29)
(sum level22 level13 level35)
(sum level22 level15 level37)
(sum level22 level20 level42)
(sum level22 level24 level46)
(sum level23 level4 level27)
(sum level23 level7 level30)
(sum level23 level13 level36)
(sum level23 level15 level38)
(sum level23 level20 level43)
(sum level23 level24 level47)
(sum level24 level4 level28)
(sum level24 level7 level31)
(sum level24 level13 level37)
(sum level24 level15 level39)
(sum level24 level20 level44)
(sum level24 level24 level48)
(sum level25 level4 level29)
(sum level25 level7 level32)
(sum level25 level13 level38)
(sum level25 level15 level40)
(sum level25 level20 level45)
(sum level25 level24 level49)
(sum level26 level4 level30)
(sum level26 level7 level33)
(sum level26 level13 level39)
(sum level26 level15 level41)
(sum level26 level20 level46)
(sum level26 level24 level50)
(sum level27 level4 level31)
(sum level27 level7 level34)
(sum level27 level13 level40)
(sum level27 level15 level42)
(sum level27 level20 level47)
(sum level27 level24 level51)
(sum level28 level4 level32)
(sum level28 level7 level35)
(sum level28 level13 level41)
(sum level28 level15 level43)
(sum level28 level20 level48)
(sum level28 level24 level52)
(sum level29 level4 level33)
(sum level29 level7 level36)
(sum level29 level13 level42)
(sum level29 level15 level44)
(sum level29 level20 level49)
(sum level29 level24 level53)
(sum level30 level4 level34)
(sum level30 level7 level37)
(sum level30 level13 level43)
(sum level30 level15 level45)
(sum level30 level20 level50)
(sum level30 level24 level54)
(sum level31 level4 level35)
(sum level31 level7 level38)
(sum level31 level13 level44)
(sum level31 level15 level46)
(sum level31 level20 level51)
(sum level31 level24 level55)
(sum level32 level4 level36)
(sum level32 level7 level39)
(sum level32 level13 level45)
(sum level32 level15 level47)
(sum level32 level20 level52)
(sum level32 level24 level56)
(sum level33 level4 level37)
(sum level33 level7 level40)
(sum level33 level13 level46)
(sum level33 level15 level48)
(sum level33 level20 level53)
(sum level33 level24 level57)
(sum level34 level4 level38)
(sum level34 level7 level41)
(sum level34 level13 level47)
(sum level34 level15 level49)
(sum level34 level20 level54)
(sum level34 level24 level58)
(sum level35 level4 level39)
(sum level35 level7 level42)
(sum level35 level13 level48)
(sum level35 level15 level50)
(sum level35 level20 level55)
(sum level35 level24 level59)
(sum level36 level4 level40)
(sum level36 level7 level43)
(sum level36 level13 level49)
(sum level36 level15 level51)
(sum level36 level20 level56)
(sum level36 level24 level60)
(sum level37 level4 level41)
(sum level37 level7 level44)
(sum level37 level13 level50)
(sum level37 level15 level52)
(sum level37 level20 level57)
(sum level37 level24 level61)
(sum level38 level4 level42)
(sum level38 level7 level45)
(sum level38 level13 level51)
(sum level38 level15 level53)
(sum level38 level20 level58)
(sum level38 level24 level62)
(sum level39 level4 level43)
(sum level39 level7 level46)
(sum level39 level13 level52)
(sum level39 level15 level54)
(sum level39 level20 level59)
(sum level39 level24 level63)
(sum level40 level4 level44)
(sum level40 level7 level47)
(sum level40 level13 level53)
(sum level40 level15 level55)
(sum level40 level20 level60)
(sum level40 level24 level64)
(sum level41 level4 level45)
(sum level41 level7 level48)
(sum level41 level13 level54)
(sum level41 level15 level56)
(sum level41 level20 level61)
(sum level41 level24 level65)
(sum level42 level4 level46)
(sum level42 level7 level49)
(sum level42 level13 level55)
(sum level42 level15 level57)
(sum level42 level20 level62)
(sum level42 level24 level66)
(sum level43 level4 level47)
(sum level43 level7 level50)
(sum level43 level13 level56)
(sum level43 level15 level58)
(sum level43 level20 level63)
(sum level43 level24 level67)
(sum level44 level4 level48)
(sum level44 level7 level51)
(sum level44 level13 level57)
(sum level44 level15 level59)
(sum level44 level20 level64)
(sum level44 level24 level68)
(sum level45 level4 level49)
(sum level45 level7 level52)
(sum level45 level13 level58)
(sum level45 level15 level60)
(sum level45 level20 level65)
(sum level45 level24 level69)
(sum level46 level4 level50)
(sum level46 level7 level53)
(sum level46 level13 level59)
(sum level46 level15 level61)
(sum level46 level20 level66)
(sum level46 level24 level70)
(sum level47 level4 level51)
(sum level47 level7 level54)
(sum level47 level13 level60)
(sum level47 level15 level62)
(sum level47 level20 level67)
(sum level47 level24 level71)
(sum level48 level4 level52)
(sum level48 level7 level55)
(sum level48 level13 level61)
(sum level48 level15 level63)
(sum level48 level20 level68)
(sum level48 level24 level72)
(sum level49 level4 level53)
(sum level49 level7 level56)
(sum level49 level13 level62)
(sum level49 level15 level64)
(sum level49 level20 level69)
(sum level49 level24 level73)
(sum level50 level4 level54)
(sum level50 level7 level57)
(sum level50 level13 level63)
(sum level50 level15 level65)
(sum level50 level20 level70)
(sum level51 level4 level55)
(sum level51 level7 level58)
(sum level51 level13 level64)
(sum level51 level15 level66)
(sum level51 level20 level71)
(sum level52 level4 level56)
(sum level52 level7 level59)
(sum level52 level13 level65)
(sum level52 level15 level67)
(sum level52 level20 level72)
(sum level53 level4 level57)
(sum level53 level7 level60)
(sum level53 level13 level66)
(sum level53 level15 level68)
(sum level53 level20 level73)
(sum level54 level4 level58)
(sum level54 level7 level61)
(sum level54 level13 level67)
(sum level54 level15 level69)
(sum level55 level4 level59)
(sum level55 level7 level62)
(sum level55 level13 level68)
(sum level55 level15 level70)
(sum level56 level4 level60)
(sum level56 level7 level63)
(sum level56 level13 level69)
(sum level56 level15 level71)
(sum level57 level4 level61)
(sum level57 level7 level64)
(sum level57 level13 level70)
(sum level57 level15 level72)
(sum level58 level4 level62)
(sum level58 level7 level65)
(sum level58 level13 level71)
(sum level58 level15 level73)
(sum level59 level4 level63)
(sum level59 level7 level66)
(sum level59 level13 level72)
(sum level60 level4 level64)
(sum level60 level7 level67)
(sum level60 level13 level73)
(sum level61 level4 level65)
(sum level61 level7 level68)
(sum level62 level4 level66)
(sum level62 level7 level69)
(sum level63 level4 level67)
(sum level63 level7 level70)
(sum level64 level4 level68)
(sum level64 level7 level71)
(sum level65 level4 level69)
(sum level65 level7 level72)
(sum level66 level4 level70)
(sum level66 level7 level73)
(sum level67 level4 level71)
(sum level68 level4 level72)
(sum level69 level4 level73)

(connected l0 l2)
(fuelcost level4 l0 l2)
(connected l0 l3)
(fuelcost level4 l0 l3)
(connected l1 l2)
(fuelcost level24 l1 l2)
(connected l1 l3)
(fuelcost level15 l1 l3)
(connected l1 l5)
(fuelcost level7 l1 l5)
(connected l2 l0)
(fuelcost level4 l2 l0)
(connected l2 l1)
(fuelcost level24 l2 l1)
(connected l2 l3)
(fuelcost level13 l2 l3)
(connected l2 l4)
(fuelcost level13 l2 l4)
(connected l3 l0)
(fuelcost level4 l3 l0)
(connected l3 l1)
(fuelcost level15 l3 l1)
(connected l3 l2)
(fuelcost level13 l3 l2)
(connected l3 l4)
(fuelcost level20 l3 l4)
(connected l3 l5)
(fuelcost level4 l3 l5)
(connected l4 l2)
(fuelcost level13 l4 l2)
(connected l4 l3)
(fuelcost level20 l4 l3)
(connected l5 l1)
(fuelcost level7 l5 l1)
(connected l5 l3)
(fuelcost level4 l5 l3)

(at t0 l3)
(fuel t0 level73)
(= (total-cost) 0)

(at p0 l3)
(at p1 l3)
(at p2 l2)
(at p3 l1)
(at p4 l3)
(at p5 l4)
(at p6 l3)
(at p7 l0)
(at p8 l3)
(at p9 l1)
(at p10 l5)
(at p11 l3)
(at p12 l0)
(at p13 l0)
)

(:goal
(and
(at p0 l2)
(at p1 l4)
(at p2 l5)
(at p3 l0)
(at p4 l4)
(at p5 l3)
(at p6 l5)
(at p7 l5)
(at p8 l2)
(at p9 l0)
(at p10 l0)
(at p11 l5)
(at p12 l3)
(at p13 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p8 t0 l3)
   deleted: (at p8 l3)
   added: (in p8 t0)
   goals met: 0 of 14
2. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 0 of 14
3. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 0 of 14
4. (load p11 t0 l3)
   deleted: (at p11 l3)
   added: (in p11 t0)
   goals met: 0 of 14
5. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 0 of 14
6. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 14
7. (drive t0 l3 l5 level69 level4 level73)
   deleted: (at t0 l3) (fuel t0 level73)
   added: (at t0 l5) (fuel t0 level69)
   goals met: 0 of 14
8. (load p10 t0 l5)
   deleted: (at p10 l5)
   added: (in p10 t0)
   goals met: 0 of 14
9. (drive t0 l5 l1 level62 level7 level69)
   deleted: (at t0 l5) (fuel t0 level69)
   added: (at t0 l1) (fuel t0 level62)
   goals met: 0 of 14
10. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 0 of 14
11. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 14
12. (drive t0 l1 l3 level47 level15 level62)
   deleted: (at t0 l1) (fuel t0 level62)
   added: (at t0 l3) (fuel t0 level47)
   goals met: 0 of 14
13. (drive t0 l3 l0 level43 level4 level47)
   deleted: (at t0 l3) (fuel t0 level47)
   added: (at t0 l0) (fuel t0 level43)
   goals met: 0 of 14
14. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 1 of 14
15. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 2 of 14
16. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 3 of 14
17. (load p7 t0 l0)
   deleted: (at p7 l0)
   added: (in p7 t0)
   goals met: 3 of 14
18. (load p13 t0 l0)
   deleted: (at p13 l0)
   added: (in p13 t0)
   goals met: 3 of 14
19. (load p12 t0 l0)
   deleted: (at p12 l0)
   added: (in p12 t0)
   goals met: 3 of 14
20. (drive t0 l0 l2 level39 level4 level43)
   deleted: (at t0 l0) (fuel t0 level43)
   added: (at t0 l2) (fuel t0 level39)
   goals met: 3 of 14
21. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 3 of 14
22. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 4 of 14
23. (unload p13 t0 l2)
   deleted: (in p13 t0)
   added: (at p13 l2)
   goals met: 5 of 14
24. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 6 of 14
25. (drive t0 l2 l4 level26 level13 level39)
   deleted: (at t0 l2) (fuel t0 level39)
   added: (at t0 l4) (fuel t0 level26)
   goals met: 6 of 14
26. (load p5 t0 l4)
   deleted: (at p5 l4)
   added: (in p5 t0)
   goals met: 6 of 14
27. (unload p1 t0 l4)
   deleted: (in p1 t0)
   added: (at p1 l4)
   goals met: 7 of 14
28. (unload p4 t0 l4)
   deleted: (in p4 t0)
   added: (at p4 l4)
   goals met: 8 of 14
29. (drive t0 l4 l3 level6 level20 level26)
   deleted: (at t0 l4) (fuel t0 level26)
   added: (at t0 l3) (fuel t0 level6)
   goals met: 8 of 14
30. (unload p12 t0 l3)
   deleted: (in p12 t0)
   added: (at p12 l3)
   goals met: 9 of 14
31. (unload p5 t0 l3)
   deleted: (in p5 t0)
   added: (at p5 l3)
   goals met: 10 of 14
32. (drive t0 l3 l5 level2 level4 level6)
   deleted: (at t0 l3) (fuel t0 level6)
   added: (at t0 l5) (fuel t0 level2)
   goals met: 10 of 14
33. (unload p11 t0 l5)
   deleted: (in p11 t0)
   added: (at p11 l5)
   goals met: 11 of 14
34. (unload p2 t0 l5)
   deleted: (in p2 t0)
   added: (at p2 l5)
   goals met: 12 of 14
35. (unload p6 t0 l5)
   deleted: (in p6 t0)
   added: (at p6 l5)
   goals met: 13 of 14
36. (unload p7 t0 l5)
   deleted: (in p7 t0)
   added: (at p7 l5)
   goals met: 14 of 14
